Revit 2022 API
Connector.PressureDrop Property
The pressure drop of the connector.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
Syntax
C#
public double PressureDrop { get; }
Visual Basic
Public ReadOnly Property PressureDrop As Double
	Get
Visual C++
public:
property double PressureDrop {
	double get ();
}
Remarks
Instantaneous pressure drop of this connector, calculated according to system.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException |  Thrown when the connector's domain is not DomainHvac or DomainPiping.
See Also
Connector Class
Autodesk.Revit.DB Namespace